/*
Отфильтровать массив чисел по максимальному и минимальному числам.
Нужно реализовать функцию, которая в параметрах всегда получает массив. И на выбор следующие параметры:
1) только минимальный элемент;
2) только максимальный элемент;
3) и минимальный, и максимальный элемент;
Если пользователю приходит только минимальный, то нужно вывести все значения, которые от минимального и выше.
Если пользователю приходит только максимальный элемент, то нужно вывести все значения до максимального.
Если приходят оба значения вывести все значения от минимального и до максимального элемента.
Input: ([-4, 6, 7, 2, -5, 8], 3, null)
Output: [6, 7, 8]
Input:([-4, 6, 7, 2, -5, 8], null, 6)
Output: [-4, 6, 2, -5]
Input: ([-4, 6, 7, 2, -5, 8], -1, 5)
Output: [2]
*/

const filterFunc = (arr, minValue, maxValue) => {
    minValue = minValue === null ? Math.min(...arr) - 1: minValue
    maxValue = maxValue === null ? Math.max(...arr) + 1: maxValue

    arr = arr.filter(el => el > minValue && el < maxValue)

    return arr
}

console.log(filterFunc(    [-4, 6, 7, 2, -5, 8],  3, null));
